<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Tableau Desktop and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.TableauDesktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Tableau Desktop</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.TableauDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%/Tableau Desktop.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/Tableau Desktop-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
