<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Memsource Editor.</string>
	<key>Identifier</key>
	<string>com.github.nin97.download.MemsourceEditor</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>MemsourceEditor</string>
		<key>NAME</key>
		<string>Memsource Editor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
			  <key>url</key>
				<string>https://www.memsource.com/download/</string>
				<key>re_pattern</key>
				<string>(http://download.memsource.com/production/updates/memsource-editor/mac/archive/install/MemsourceEditor-(.*?)-mac.app.zip)</string>
				<key>result_output_var_name</key>
				<string>url</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%APP_FILENAME%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
